var names = ['Андрей', 'Александр', 'Сергей', 'Владимир', 'Леонид'];

var enterName = prompt('Введите имя', '');

if (enterName == 'Андрей') {
	alert('Андрей, Вы вошли успешно.');
} else if (enterName == 'Александр') {
	alert('Александр, Вы вошли успешно.');
} else if (enterName == 'Сергей') {
	alert('Сергей, Вы вошли успешно.');
} else if (enterName == 'Владимир') {
	alert('Владимир, Вы вошли успешно.');
} else if (enterName == 'Леонид') {
	alert('Леонид, Вы вошли успешно.');
} else {
	alert('Неправильное имя. Пожалуйста, перезагрузите страницу и попробуйте еще раз.');	
}
